		 
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Модуль = РеквизитФормыВЗначение("Объект");
	МассивКоманд = Модуль.ПолучитьСписокКоманд();
	
	Если Не МассивКоманд.Количество() Тогда Возврат КонецЕсли;

	Для каждого СтрКоманды Из МассивКоманд Цикл
		//Создание команды
		НоваяКоманда = ЭтаФорма.Команды.Добавить(СтрКоманды.Идентификатор);
		НоваяКоманда.Заголовок = СтрКоманды.Представление;
		НоваяКоманда.Действие = "ВыполнениеКоманды";
		
		//Создание кнопок
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить(СтрКоманды.Идентификатор, Тип("КнопкаФормы"), Элементы.ГруппаКнопокРегламенты);
		НовыйЭлемент.Заголовок = СтрКоманды.Представление;
		НовыйЭлемент.ИмяКоманды = СтрКоманды.Идентификатор;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы  

&НаСервере
Функция ПолучитьЗаголовокКоманды(Команда)
	Возврат Команда.Заголовок;
КонецФункции 
 
&НаКлиенте
Процедура СохранитьЛогирование(Команда)
	
	Если ПустаяСтрока(Логирование.ПолучитьТекст()) Тогда 
		ПоказатьПредупреждение("Логирование пустое. Сохранение невозможно",, 30, "Ошибка сохранения"); 
		Возврат;
	КонецЕсли;
	
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение); 
	ДиалогСохраненияФайла.ПолноеИмяФайла = ВыполняемыйМетод; 
	ДиалогСохраненияФайла.Фильтр = "Текст(*.txt)|*.txt"; 
	ДиалогСохраненияФайла.МножественныйВыбор = Ложь; 
	ДиалогСохраненияФайла.Заголовок = "Сохранение"; 
	
	Если ДиалогСохраненияФайла.Выбрать() Тогда 
		Логирование.Записать(ДиалогСохраненияФайла.ПолноеИмяФайла);   	
		ПоказатьОповещениеПользователя("Файл сохранен", Новый ОписаниеОповещения("ОткрытьФайл", ЭтаФорма, ДиалогСохраненияФайла.ПолноеИмяФайла), ДиалогСохраненияФайла.ПолноеИмяФайла);
	КонецЕсли;	
	
КонецПроцедуры     

&НаКлиенте
Процедура ВыполнениеКоманды(Команда)
	
	ЗаполнитьЛогирование(СтрШаблон("Регламент: %1", Команда.Имя),, Истина);
	ЗаполнитьЛогирование(,,,, Истина);
	
	ИдентификаторКоманды = Команда.Имя;

    ПараметрыКоманды = Новый Структура("ДополнительнаяОбработкаСсылка", ОбъектСсылка);

    Если Не Объект.ВФоне Тогда
        РезультатВыполнения = ВыполнениеКомандыНаСервере(ИдентификаторКоманды, ПараметрыКоманды);
		
		Если ТипЗнч(ПараметрыКоманды) = Тип("Структура") И ПараметрыКоманды.Свойство("РезультатВыполнения") И ПараметрыКоманды.РезультатВыполнения.Свойство("Ответ") Тогда  
			ЭтоПервый = Истина;
			
			Для каждого СтрОтвета Из ПараметрыКоманды.РезультатВыполнения.Ответ Цикл       
				Если ЭтоПервый Тогда 
					ЭтоПервый = Ложь;
				Иначе 
					Логирование.ДобавитьСтроку("------------------------------------------------------------");
				КонецЕсли;
				
				//Логирование.ДобавитьСтроку(СтрШаблон("Кабинет: %1", СтрОтвета.Кабинет));     
				ЗаполнитьЛогирование(, СтрОтвета);
			КонецЦикла;      
			
			
			ЗаполнитьЛогирование(СтрШаблон("Регламента: %1", Команда.Имя),,, Истина);
		КонецЕсли;
    Иначе
        ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьКомандуВФоне(ИдентификаторКоманды, ПараметрыКоманды, ЭтаФорма);
	КонецЕсли;  

КонецПроцедуры

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Функция ПолучитьИдентификаторСерверногоМетодаОбработки()    
	
	Модуль = РеквизитФормыВЗначение("Объект");  
	
	Возврат Модуль.Метаданные().Имя;     
	
КонецФункции 

&НаКлиенте
Процедура УстановитьНаименованиеВыполняемогоМетода(Наименование)
	
	ВыполняемыйМетод = СтрШаблон("%1%2", Наименование,
					   ?(ЗначениеЗаполнено(Период.ДатаНачала) Или ЗначениеЗаполнено(Период.ДатаОкончания), СтрШаблон("%1%2", 
					   ?(ЗначениеЗаполнено(Период.ДатаНачала), СтрШаблон(" от %1", Формат(Период.ДатаНачала, "ДЛФ=D")), ""), 
					   ?(ЗначениеЗаполнено(Период.ДатаОкончания), СтрШаблон(" по %1", Формат(Период.ДатаОкончания, "ДЛФ=D")), "")), ""));

КонецПроцедуры

&НаСервере
Функция ВыполнениеКомандыНаСервере(ИдентификаторКоманды, ПараметрыКоманды)

    Возврат ДополнительныеОтчетыИОбработки.ВыполнитьКомандуИзФормыВнешнегоОбъекта(ИдентификаторКоманды, ПараметрыКоманды, ЭтаФорма);

КонецФункции          

&НаСервере
Процедура ЗаполнитьЛогирование(ЗаголовокЛогирования = "", ДополнительныеПараметры = Неопределено, ЭтоНачало = Ложь, ЭтоКонец = Ложь, ЭтоПереход = Ложь)

	//Начало логирования
	Если ЭтоНачало Тогда 
		Логирование.Очистить();
		Логирование.ДобавитьСтроку(СтрШаблон("Старт %1: %2", ЗаголовокЛогирования, Формат(ТекущаяДатаСеанса(), "ДЛФ=DDT")));
		Возврат;
	КонецЕсли;   
	//
	
	//Окончание логирования   
	Если ЭтоКонец Тогда 
		Логирование.ДобавитьСтроку(СтрШаблон("Окончание %1: %2", ЗаголовокЛогирования, Формат(ТекущаяДатаСеанса(), "ДЛФ=DDT")));
		Возврат;
	КонецЕсли; 
	//
	
	//Переход   
	Если ЭтоПереход Тогда 
		Логирование.ДобавитьСтроку("------------------------------------------------------------");
		Логирование.ДобавитьСтроку("------------------------------------------------------------");	      
		Возврат;
	КонецЕсли;   
	//
	
	Если ДополнительныеПараметры = Неопределено Тогда Возврат КонецЕсли;
	
	//Логирование успешных данных
	Если ДополнительныеПараметры.СообщенияПользователю.Количество() Тогда 
		Логирование.ДобавитьСтроку("Сообщения:");
	
		Для каждого СтрОшибки Из ДополнительныеПараметры.СообщенияПользователю Цикл
			Логирование.ДобавитьСтроку(СтрОшибки);
		КонецЦикла;
	КонецЕсли;
	
	////Логирование ошибок
	//Если ДополнительныеПараметры.Ошибки.Количество() Тогда 
	//	Логирование.ДобавитьСтроку("Ошибки:");
	//
	//	Для каждого СтрОшибки Из ДополнительныеПараметры.Ошибки Цикл
	//		Логирование.ДобавитьСтроку(СтрОшибки);
	//	КонецЦикла;
	//КонецЕсли;
	//

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(ПутььКФайлу) Экспорт
	ЗапуститьПриложение(ПутььКФайлу);
КонецПроцедуры

#КонецОбласти		 
