
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Модуль = РеквизитФормыВЗначение("Объект");       
	
	ИмяОбработки = Модуль.Метаданные().Имя;
    	
	МассивПараметровВыбора = Новый Массив;
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Сайт", ПредопределенноеЗначение("Справочник.СайтыМаркетплейсов.Wildberies")));
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Активность", Истина));       
	
	Элементы.Кабинет.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ГруппаЛогирование.Видимость = Ложь;
	
	УстановитьЗаголовокКнопкиПоказатьСпрятатьЛогирование();
	
	ОбновитьЗаголовкиСтраниц();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КабинетПриИзменении(Элемент)
	
	ОчиститьДанные();        
	
	УстановитьЗаголовокКнопкиПоказатьСпрятатьЛогирование();

КонецПроцедуры

&НаКлиенте
Процедура КабинетОчистка(Элемент, СтандартнаяОбработка)
	
	ОчиститьДанные();                                   
	
	УстановитьЗаголовокКнопкиПоказатьСпрятатьЛогирование();  
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьСпрятатьЛогирование(Команда)
	
	Элементы.ГруппаЛогирование.Видимость = Не Элементы.ГруппаЛогирование.Видимость;  
	
	УстановитьЗаголовокКнопкиПоказатьСпрятатьЛогирование();

КонецПроцедуры

&НаКлиенте
Процедура ФормаРегламенты(Команда)
	ОткрытьФорму(СтрШаблон("ВнешняяОбработка.%1.Форма.ФормаРегламенты", ИмяОбработки),, ЭтаФорма);
КонецПроцедуры 

&НаКлиенте
Процедура КомандаОстатки(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда Возврат КонецЕсли;
	
	Попытка
		Выполнить(СтрШаблон("%1()", Команда.Имя));
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("При выполнении команды '%1' произошла ошибка: %2", Команда.Имя, ОписаниеОшибки()));	
	КонецПопытки; 
	
	УстановитьЗаголовокКнопкиПоказатьСпрятатьЛогирование();
	ОбновитьЗаголовкиСтраниц();
	 
КонецПроцедуры

#КонецОбласти 

#Область ПроцедурыКоманд

&НаСервере
Процедура Остатки_Заполнить()
	
	ОчиститьДанные();
	
	ДанныеИнициализации = Неопределено; 
	ЕстьОшибки = Ложь;
	
	МодульОбработки = РеквизитФормыВЗначение("Объект");
	МодульОбработки.ИнициализацияДанных(Кабинет, ДанныеИнициализации, ЕстьОшибки, Истина);   
			
	ТаблицаОстатков.Загрузить(МодульОбработки.ПолучитьТекущиеОстаткиНаМаркетплейсе(МодульОбработки.ПолучитьАктивныеТоварыПоКабиненту()));

КонецПроцедуры

&НаСервере
Процедура Остатки_Отправить()
	
	ЗаголовокЛогирования = "Отправка остатков на маркетплейс"; 
	
	ЗаполнитьЛогирование(ЗаголовокЛогирования,, Истина);
	ЗаполнитьЛогирование(,,,, Истина);
	Логирование.ДобавитьСтроку(СтрШаблон("Кабинет: %1", Кабинет));     
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СОКРЛП(ВЫРАЗИТЬ(ТЗ.ИдентификаторСклада КАК СТРОКА(50))) КАК ИдентификаторСклада,
	|	СОКРЛП(ВЫРАЗИТЬ(ТЗ.ИдентификаторХарактеристикиМП КАК СТРОКА(50))) КАК ИдентификаторХарактеристикиМП,
	|	ВЫРАЗИТЬ(ТЗ.СвободныйОстаток КАК ЧИСЛО(10, 0)) КАК СвободныйОстаток,
	|	ВЫРАЗИТЬ(ТЗ.ВыбратьСтроку КАК БУЛЕВО) КАК ВыбратьСтроку
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ИдентификаторСклада КАК ИдентификаторСклада,
	|	ВТ.ИдентификаторХарактеристикиМП КАК ИдентификаторХарактеристикиМП,
	|	ВТ.СвободныйОстаток КАК СвободныйОстаток
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.ВыбратьСтроку");     
	
	Запрос.УстановитьПараметр("ТЗ", ТаблицаОстатков.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	Если РезультатЗапроса.Пустой() Тогда Возврат КонецЕсли;
	
	ДанныеИнициализации = Неопределено; 
	ЕстьОшибки = Ложь;
	
	МодульОбработки = РеквизитФормыВЗначение("Объект");
	МодульОбработки.ИнициализацияДанных(Кабинет, ДанныеИнициализации, ЕстьОшибки, Истина);  
	
	МодульОбработки.ОтправитьОстатки(Новый Структура("ТаблицаОстатков", РезультатЗапроса.Выгрузить()));
	
	ЗаполнитьЛогирование(, ДанныеИнициализации.ВыходныеДанные);			
	ЗаполнитьЛогирование(ЗаголовокЛогирования,,, Истина);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции  

&НаКлиенте
Процедура ОбновитьЗаголовкиСтраниц()

	Элементы.СтраницаОстатки.Заголовок = СтрШаблон("Остатки (%1 поз.)", ТаблицаОстатков.Количество());	

КонецПроцедуры

&НаСервере
Процедура ОчиститьДанные()

	ТаблицаОстатков.Очистить();	 

	Логирование.Очистить();

КонецПроцедуры 

&НаКлиенте
Процедура УстановитьЗаголовокКнопкиПоказатьСпрятатьЛогирование()
	
	Элементы.ФормаПоказатьСпрятатьЛогирование.Заголовок = СтрШаблон("%1 логирование%2", ?(Элементы.ГруппаЛогирование.Видимость, "Спрятать", "Показать"));
	
	Элементы.ФормаПоказатьСпрятатьЛогирование.Картинка = БиблиотекаКартинок.Пустая;         
	Элементы.ФормаПоказатьСпрятатьЛогирование.Отображение = ОтображениеКнопки.Текст;
	
	Если Не ПустаяСтрока(Логирование.ПолучитьТекст()) Тогда 
		Элементы.ФормаПоказатьСпрятатьЛогирование.Картинка = БиблиотекаКартинок.Изменить;  
		Элементы.ФормаПоказатьСпрятатьЛогирование.Отображение = ОтображениеКнопки.КартинкаИТекст;
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьЛогирование(ЗаголовокЛогирования = "", ДополнительныеПараметры = Неопределено, ЭтоНачало = Ложь, ЭтоКонец = Ложь, ЭтоПереход = Ложь)
	
	//Начало логирования
	Если ЭтоНачало Тогда 
		Логирование.Очистить();
		Логирование.ДобавитьСтроку(СтрШаблон("Старт %1: %2", ЗаголовокЛогирования, Формат(ТекущаяДатаСеанса(), "ДЛФ=DDT")));
		Возврат;
	КонецЕсли;   
	//
	
	//Окончание логирования   
	Если ЭтоКонец Тогда 
		Логирование.ДобавитьСтроку(СтрШаблон("Окончание %1: %2", ЗаголовокЛогирования, Формат(ТекущаяДатаСеанса(), "ДЛФ=DDT")));
		Возврат;
	КонецЕсли; 
	//
	
	//Переход   
	Если ЭтоПереход Тогда 
		Логирование.ДобавитьСтроку("------------------------------------------------------------");
		Логирование.ДобавитьСтроку("------------------------------------------------------------");	      
		Возврат;
	КонецЕсли;   
	//
	
	Если ДополнительныеПараметры = Неопределено Или (Не ДополнительныеПараметры.Успешные.Количество() И Не ДополнительныеПараметры.Ошибки.Количество()) Тогда Возврат КонецЕсли;
	
	//Логирование успешных данных
	Если ДополнительныеПараметры.Успешные.Количество() Тогда 
		Логирование.ДобавитьСтроку("Успешные:");
	
		Для каждого СтрОшибки Из ДополнительныеПараметры.Успешные Цикл
			Логирование.ДобавитьСтроку(СтрОшибки);
		КонецЦикла;
	КонецЕсли;
	
	//Логирование ошибок
	Если ДополнительныеПараметры.Ошибки.Количество() Тогда 
		Логирование.ДобавитьСтроку("Ошибки:");
	
		Для каждого СтрОшибки Из ДополнительныеПараметры.Ошибки Цикл
			Логирование.ДобавитьСтроку(СтрОшибки);
		КонецЦикла;
	КонецЕсли;
	//

КонецПроцедуры

&НаСервере
Процедура ТЕСТНаСервере()
	
	ЕстьОшибки = Ложь; 
	
	//Документ = XMLЗначение(Тип("ДокументСсылка.Отгрузка"), "b7a17841-cc41-11f0-aed4-c81fbe985cec");
	Документ = XMLЗначение(Тип("ДокументСсылка.Отправление"), "d013fca1-07e1-11f1-aed6-c81fbe985cec"); 
	
	
	МассивО = Новый Массив;
	МассивО.Добавить(Документ);
	
	ВходныеДанные = Новый Структура("РезультатВыполнения, ОбъектыНазначения", Новый Структура, МассивО);	 
	
	МодульОбработки = РеквизитФормыВЗначение("Объект");
	
	МодульОбработки.ВыполнитьКоманду("ПолучениеЭтикеток", ВходныеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТЕСТ(Команда)
	ТЕСТНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Остатки_ВыбратьВсе(Команда)
	
	Для Каждого ДанныеСтроки Из ТаблицаОстатков Цикл
		ДанныеСтроки.ВыбратьСтроку = Истина;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура Остатки_СнятьВсе(Команда)
	
	Для Каждого ДанныеСтроки Из ТаблицаОстатков Цикл
		ДанныеСтроки.ВыбратьСтроку = Ложь;
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти